// export const housing = {
//   "корпус"
// }

export const GOOGLE_MAPS_URL = 'https://www.google.com/maps/embed/v1/directions';

export const auditory = {
  "125": {
    text: "Аудитория 125 находится в первом корпусе на первом этаже.",
    housing: 1,
  },
  "126": {
    text: "Аудитория 126 находится в первом корпусе на первом этаже.",
    housing: 1,
  },
  "164": {
    text: "Аудитория 164 находится в первом корпусе на первом этаже.",
    housing: 1,
  },
  "214": {
    text: "Аудитория 214 находится в первом корпусе на втором этаже.",
    housing: 1,
  },
  "222": {
    text: "Аудитория 222 находится в первом корпусе на втором этаже.",
    housing: 1,
  },
  "277": {
    text: "Аудитория 277 находится в первом корпусе на втором этаже.",
    housing: 1,
  },
  "320": {
    text: "Аудитория 320 находится в первом корпусе на третьем этаже.",
    housing: 1,
  },
  "357": {
    text: "Аудитория 357 находится в первом корпусе на третьем этаже.",
    housing: 1,
  },
  "368": {
    text: "Аудитория 368 находится в первом корпусе на третьем этаже.",
    housing: 1,
  },
  "102": {
    text: "Аудитория 102 находится во втором корпусе на первом этаже.",
    housing: 2,
  },
  "108": {
    text: "Аудитория 108 находится во втором корпусе на первом этаже.",
    housing: 2,
  },
  "117": {
    text: "Аудитория 117 находится во втором корпусе на первом этаже.",
    housing: 2,
  },
  "201": {
    text: "Аудитория 201 находится во втором корпусе на втором этаже.",
    housing: 2,
  },
  "205": {
    text: "Аудитория 205 находится во втором корпусе на втором этаже.",
    housing: 2,
  },
  "211": {
    text: "Аудитория 211 находится во втором корпусе на первом этаже.",
    housing: 2,
  },
  "10": {
    text: "Аудитория 10 находится в третьем корпусе на первом этаже.",
    housing: 3,
  },
  "11": {
    text: "Аудитория 11 находится в третьем корпусе на первом этаже.",
    housing: 3,
  },
  "20": {
    text: "Аудитория 20 находится в третьем корпусе на втором этаже.",
    housing: 3,
  },
  "21": {
    text: "Аудитория 21 находится в третьем корпусе на втором этаже.",
    housing: 3,
  },
  "30": {
    text: "Аудитория 30 находится в третьем корпусе на третьем этаже.",
    housing: 3,
  },
  "31": {
    text: "Аудитория 31 находится в третьем корпусе на третьем этаже.",
    housing: 3,
  },
  "40": {
    text: "Аудитория 40 находится в третьем корпусе на четвертом этаже.",
    housing: 3,
  },
  "41": {
    text: "Аудитория 41 находится в третьем корпусе на четвертом этаже.",
    housing: 3,
  },
  "50": {
    text: "Аудитория 50 находится в третьем корпусе на пятом этаже.",
    housing: 3,
  },
  "51": {
    text: "Аудитория 51 находится в третьем корпусе на пятом этаже.",
    housing: 3,
  },
  "52": {
    text: "Аудитория 52 находится в третьем корпусе на пятом этаже.",
    housing: 3,
  },
  "55": {
    text: "Аудитория 55 находится в третьем корпусе на пятом этаже.",
    housing: 3,
  },
  "56": {
    text: "Аудитория 50 находится в третьем корпусе на пятом этаже.",
    housing: 3,
  },
  "56": {
    text: "Аудитория 56 находится в третьем корпусе на пятом этаже.",
    housing: 3,
  },
  "57": {
    text: "Аудитория 57 находится в третьем корпусе на пятом этаже.",
    housing: 3,
  },
  "58": {
    text: "Аудитория 58 находится в третьем корпусе на пятом этаже.",
    housing: 3,
  },
  "185": {
    text: "Аудитория 185 находится в четвертом корпусе на первом этаже.",
    housing: 4,
  },
  "191": {
    text: "Аудитория 191 находится в четвертом корпусе на первом этаже.",
    housing: 4,
  },
  "198": {
    text: "Аудитория 198 находится в четвертом корпусе на первом этаже.",
    housing: 4,
  },
  "285": {
    text: "Аудитория 285 находится в четвертом корпусе на втором этаже.",
    housing: 4,
  },
  "292": {
    text: "Аудитория 292 находится в четвертом корпусе на втором этаже.",
    housing: 4,
  },
  "298": {
    text: "Аудитория 298 находится в четвертом корпусе на втором этаже.",
    housing: 4,
  },
  "385": {
    text: "Аудитория 385 находится в четвертом корпусе на третьем этаже.",
    housing: 4,
  },
  "389": {
    text: "Аудитория 389 находится в четвертом корпусе на третьем этаже.",
    housing: 4,
  },
  "394": {
    text: "Аудитория 394 находится в четвертом корпусе на третьем этаже.",
    housing: 4,
  },
  "483": {
    text: "Аудитория 483 находится в четвертом корпусе на четвертом этаже.",
    housing: 4,
  },
  "488": {
    text: "Аудитория 488 находится в четвертом корпусе на четвертом этаже.",
    housing: 4,
  },
  "498": {
    text: "Аудитория 498 находится в четвертом корпусе на четвертом этаже.",
    housing: 4,
  },
  "520": {
    text: "Аудитория 498 находится в пятом корпусе на втором этаже.",
    housing: 5,
  },
  "524": {
    text: "Аудитория 524 находится в пятом корпусе на втором этаже.",
    housing: 5,
  },
  "529": {
    text: "Аудитория 529 находится в пятом корпусе на втором этаже.",
    housing: 5,
  },
  "530": {
    text: "Аудитория 530 находится в пятом корпусе на третьем этаже.",
    housing: 5,
  },
  "534": {
    text: "Аудитория 534 находится в пятом корпусе на третьем этаже.",
    housing: 5,
  },
  "538": {
    text: "Аудитория 538 находится в пятом корпусе на третьем этаже.",
    housing: 5,
  },
  "540": {
    text: "Аудитория 540 находится в пятом корпусе на четвертом этаже.",
    housing: 5,
  },
  "543": {
    text: "Аудитория 543 находится в пятом корпусе на четвертом этаже.",
    housing: 5,
  },
  "545": {
    text: "Аудитория 545 находится в пятом корпусе на четвертом этаже.",
    housing: 5,
  },
};

export const MAP_SETTINGS = {
  mode: 'walking',
  api_key: 'AIzaSyDqKg-GazGmOypzATlgFFZPF_b6Q32DXKQ',
};

export const geolocationParams = {
    maximumAge: 0,
    timeout: 10000,
};

export const destinations = {
  '1': {
    title: 'Корпус 1',
    destination: '%D0%A3%D1%87%D0%B5%D0%B1%D0%BD%D1%8B%D0%B9%20%D0%BA%D0%BE%D1%80%D0%BF%D1%83%D1%81%20%D0%97%D0%9D%D0%A2%D0%A3%20%E2%84%963%2C%20%D0%B2%D1%83%D0%BB%D0%B8%D1%86%D1%8F%20%D0%A2%D1%83%D1%80%D0%B3%D0%B5%D0%BD%D1%94%D0%B2%D0%B0%2C%2037%2F64%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%8C%D0%B5%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%81%D0%BA%D0%B0%D1%8F%20%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C%2C%2069061',
  },
  '2': {
    id: 2,
    title: 'Корпус 2',
    destination: '%D0%A3%D1%87%D0%B5%D0%B1%D0%BD%D1%8B%D0%B9%20%D0%BA%D0%BE%D1%80%D0%BF%D1%83%D1%81%20%D0%97%D0%9D%D0%A2%D0%A3%20%E2%84%963%2C%20%D0%B2%D1%83%D0%BB%D0%B8%D1%86%D1%8F%20%D0%A2%D1%83%D1%80%D0%B3%D0%B5%D0%BD%D1%94%D0%B2%D0%B0%2C%2037%2F64%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%8C%D0%B5%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%81%D0%BA%D0%B0%D1%8F%20%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C%2C%2069061',
  },
  '3': {
    id: 3,
    title: 'Корпус 3',
    destination: '%D0%A3%D1%87%D0%B5%D0%B1%D0%BD%D1%8B%D0%B9%20%D0%BA%D0%BE%D1%80%D0%BF%D1%83%D1%81%20%D0%97%D0%9D%D0%A2%D0%A3%20%E2%84%963%2C%20%D0%B2%D1%83%D0%BB%D0%B8%D1%86%D1%8F%20%D0%A2%D1%83%D1%80%D0%B3%D0%B5%D0%BD%D1%94%D0%B2%D0%B0%2C%2037%2F64%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%8C%D0%B5%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%81%D0%BA%D0%B0%D1%8F%20%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C%2C%2069061',
  },
  '4': {
    id: 4,
    title: 'Корпус 4',
    destination: '%D0%A3%D1%87%D0%B5%D0%B1%D0%BD%D1%8B%D0%B9%20%D0%BA%D0%BE%D1%80%D0%BF%D1%83%D1%81%20%D0%97%D0%9D%D0%A2%D0%A3%20%E2%84%963%2C%20%D0%B2%D1%83%D0%BB%D0%B8%D1%86%D1%8F%20%D0%A2%D1%83%D1%80%D0%B3%D0%B5%D0%BD%D1%94%D0%B2%D0%B0%2C%2037%2F64%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%8C%D0%B5%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%81%D0%BA%D0%B0%D1%8F%20%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C%2C%2069061',
  },
  '5': {
    id: 5,
    title: 'Корпус 5',
    destination: '%D0%A3%D1%87%D0%B5%D0%B1%D0%BD%D1%8B%D0%B9%20%D0%BA%D0%BE%D1%80%D0%BF%D1%83%D1%81%20%D0%97%D0%9D%D0%A2%D0%A3%20%E2%84%963%2C%20%D0%B2%D1%83%D0%BB%D0%B8%D1%86%D1%8F%20%D0%A2%D1%83%D1%80%D0%B3%D0%B5%D0%BD%D1%94%D0%B2%D0%B0%2C%2037%2F64%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%8C%D0%B5%2C%20%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D0%BE%D0%B6%D1%81%D0%BA%D0%B0%D1%8F%20%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C%2C%2069061',
  },
};

export const numbers = {
  "первая": "1",
  "первую": "1",
  "первый": "1",
  "вторая": "2",
  "вторую": "2",
  "второй": "2",
  "третья": "3",
  "трутью": "3",
  "третий": "3",
  "четвертая": "4",
  "четвертую": "4",
  "четвертый": "4",
  "пятая": "5",
  "пятую": "5",
  "пятый": "5",
  "шестая": "6",
  "шестую": "6",
  "шестой": "6",
  "седьмая": "7",
  "седьмую": "7",
  "седьмой": "7",
  "восьмая": "8",
  "восьмую": "8",
  "восьмой": "8",
  "девятая": "9",
  "девятую": "9",
  "девятый": "9"
}
